app/controllers/entries_controller.rb

  def index
    @entries = Entry.tally({ :order => 'votes.count desc'})
---
SELECT count(*) AS count_all FROM "votes" WHERE (voteable_id = 1 AND voteable_type = 'Entry' AND vote = 't')