app/controllers/entries_controller.rb

  def index
    @entries = Entry.all
---
SELECT * FROM "entries"

  def show
    @entry = Entry.find(params[:id])
---
SELECT * FROM "entries" WHERE ("entries"."id" = 1)

  def create
    @entry = Entry.new(params[:entry])
    if @entry.save
---
INSERT INTO "entries" ("photog", "photo_file_size", "created_at", "title", "photo_file_name", "updated_at", "photog_link", "photo_content_type", "desc", "photo_uploaded_at") VALUES('Donnie', 575228, '2009-04-15 22:42:01', 'Test 2', 'converting_splits.jpg', '2009-04-15 22:42:01', '', 'image/jpeg', 'Another Test', NULL)

  def edit
    @entry = Entry.find(params[:id])
---
SELECT * FROM "entries" WHERE ("entries"."id" = 1)

  def update
    @entry = Entry.find(params[:id])
    if @entry.update_attributes(params[:entry])
---
SELECT * FROM "entries" WHERE ("entries"."id" = 1)
UPDATE "entries" SET "photog_link" = 'http://skiwhitefish.com', "updated_at" = '2009-04-15 22:40:13', "photo_file_name" = 'DonnieSickSki.jpg', "photo_file_size" = 195990, "photo_content_type" = 'image/jpeg' WHERE "id" = 1

  def vote
    @entry = Entry.find(params[:id])
    @robot = Robot.first
---
SELECT * FROM "entries" WHERE ("entries"."id" = 1)
SELECT * FROM "robots" LIMIT 1